Revit 2026 API

# BuiltInFailuresKeynoteTagFailures Class

---

Failures related to keynote tags.

SystemObject Autodesk.Revit.DBBuiltInFailuresKeynoteTagFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class KeynoteTagFailures
```
```vb
Public NotInheritable Class KeynoteTagFailures
```
```cpp
public ref class KeynoteTagFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type KeynoteTagFailures = class end
```

The BuiltInFailuresKeynoteTagFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | KeynoteOnLinkWithDifferentKeynoteFile | The parameters of the keynote tag are empty because the keynoted linked element uses a different keynote file. |
|  | NoKeynoteAssignedToLinkedElement | The parameters of the keynote tag are empty because the keynoted linked element uses a different keynote file. |

#### Reference

Autodesk.Revit.DB Namespace